# Introducción a Pandas

A continuación vamos a introducir las principales funciones de pandas.

El primer paso es importar la librería como pd.

In [2]:
import pandas as pd

# Creación de datos

En primer lugar, vamos a empezar creando los objetos desde cero. Muchas veces, contaréis con archivos preexistentes. Por ejemplo los datos en un archivo .csv o tendréis acceso a ellos mediante una API. 

Primero vamos a hablar de los dos objetos principales de pandas:  "DataFrame" y "Serie".

## DataFrame

Un DataFrame es una tabla. Contiene un array de entradas individuales, cada una de las cuales tiene un valor determinado. Cada entrada corresponde a una fila (o registro) y a una columna.

Pongamos un ejemplo de un DataFrame sencillo:

In [3]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

Laa función para crear estos objetos llamados dataframes es: pd.DataFrame(). Para crear estos objetos se utiliza un diccionario donde las llaves corresponden a las columnas del dataframe (en este caso las columnas son Bob y Sue) y la lista de valores corresponde a la información que aparece en las distintas filas. Esta es la manera más sencilla de crear un dataframe desde cero.

También tenemos los valores del índice numérico que nos sirve para identificar la fila correspondiente. 0 corresponde a la primera fila y así sucesivamente.

En lugar de utilizar los valores numéricos, podemos asignar valores personalizadas al Índice:

In [4]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

Pandas es una librería o biblioteca muy extensa, por eso es necesario aprender a leer y entender la documentación. Aquí tenéis un acceso para empezar a explorar y conocer mejor algunas de estas funciones:

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html?highlight=dataframe#pandas.DataFrame

También se puede acceder a la información utilizando "?" y podremos acceder directamente a la documentación

In [5]:
? pd.DataFrame

Init signature:
 pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
)
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index.

    .. versionchanged:: 0.25.0
       If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3
File:           ~/opt/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py
Type:           type
Subclasses:     SubclassedDataFrame

## Series

Una Serie, por el contrario, es una secuencia de valores de datos. Si un DataFrame es una tabla, una Serie es una lista. Y puede considerarse una columna del DataFrame. La manera más sencilla de crear una serie es con una lista:

In [6]:
pd.Series([30, 35, 40])

0    30
1    35
2    40
dtype: int64

A una Serie también se le puede asignar un índice, aunque no tiene un nombre de columna como tal.

In [7]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

# Lectura de archivos de datos

Lo más habitual será que ya contemos con un archivo de datos y tengamos que exportarlo a Python. 

El formato más común es el .csv y pandas cuenta con la función pd.read_csv() para poder exportarlos. Utilizando la URL del archivo o el path en el que se encuentra en nuestro ordenador será suficiente para poder obtener el archivo. 

En este caso vamos a exportar el Iris dataset, una base de datos muy útil para entrenar algoritmos de clasificación.

In [8]:
pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/iris-data.csv')

     sepal length  sepal width  petal length  petal width           class
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

La tabla generada (o dataframe) la vamos a seguir usando, así que lo mejor será guardarla como un objeto. 

Esto nos permitirá seguir realizando operaciones y modificaciones en este dataframe.

In [9]:
iris = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/iris-data.csv')

Algunas funciones nos dan información sobre los datos. Estas funciones son muy útiles para hacernos una idea rápida y empezar a entender las variables que forman nuestro dataframe.

In [10]:
iris.head(3) # muestra las primeras 3 filas

   sepal length  sepal width  petal length  petal width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa

In [11]:
iris.tail() # muestra las últimas 5 filas

     sepal length  sepal width  petal length  petal width           class
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [12]:
iris.shape # número de filas x columnas

(150, 5)

In [13]:
iris.info() # muestra los atributos, el tipo de datos y si contienen valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal length  150 non-null    float64
 1   sepal width   150 non-null    float64
 2   petal length  150 non-null    float64
 3   petal width   150 non-null    float64
 4   class         150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [14]:
iris.describe() # información estadística básica

       sepal length  sepal width  petal length  petal width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [15]:
iris['sepal length'].median() # también se puede llamar a una operación en una sola variable

5.8

Para saber el nombre de valores únicos en una variable categórica, se puede utilizar set() o unique()

In [16]:
set(iris['class'])

{'Iris-setosa', 'Iris-versicolor', 'Iris-virginica'}

In [17]:
iris['class'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

La función value_counts() muestra los valores únicos en una variable y el número de veces que cada uno ocurre.

In [18]:
iris['class'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: class, dtype: int64

### Acceso a columnas en Python

En Python, podemos acceder a las propiedades de los objetos. En este caso, tenemos que iris es un objeto y los nombres de las columnas son propiedades. Un objeto libro, por ejemplo, puede tener una propiedad título, lo mismo pasa con un pd.DataFrame(). Para acceder a las columnas tendremos que llamar primero al objeto (coger el libro) y abrir la propiedad (abrir el capítulo que nos interesa).

La sintaxis para hacer esto en pandas es df.col o df['col']

In [19]:
iris['class'].head(3)

0    Iris-setosa
1    Iris-setosa
2    Iris-setosa
Name: class, dtype: object

## Selección, eliminación y creacción de atributos

Estas son las dos formas de seleccionar una columna (o Serie) específica de un DataFrame. Ambas son válida sintácticamente, pero el operador []  puede manejar nombres de columnas con caracteres reservados (por ejemplo, seleccionar una clumna con un nombre compuesto con espacios en blanco o con carácteres reservados como "class" o "def").

Además, este operador nos va a permitir seleccionar una lista de series y seleccionar un grupo de los atributos del dataset origninal.

In [20]:
cols = ['sepal length', 'sepal width']

sepal = iris[cols]

sepal.head()

   sepal length  sepal width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

También podemos acceder a un valor añadiendo a la Serie el número de la fila que queremos acceder:

In [21]:
iris['sepal length'][0]

5.1

Otra función útil para eliminar atributos es la función DataFrame.drop(). Esta función permite eliminar columnas o filas determinadas en base al nombre o a la posición.

In [22]:
sepal.drop(columns=['sepal width']) # drop by column

     sepal length
0             5.1
1             4.9
2             4.7
3             4.6
4             5.0
..            ...
145           6.7
146           6.3
147           6.5
148           6.2
149           5.9

[150 rows x 1 columns]

In [23]:
sepal.drop([1, 2, 3, 7]).head() # drop by index

   sepal length  sepal width
0           5.1          3.5
4           5.0          3.6
5           5.4          3.9
6           4.6          3.4
8           4.4          2.9

También podemos crear nuevas variables a partir de series de un data frame

In [24]:
sepal['mean'] = (sepal['sepal length'] + sepal['sepal width'])/2

sepal.head()

/var/folders/vc/dhymnk052dz8zs7gq81kypgw0000gn/T/ipykernel_57167/3787329706.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sepal['mean'] = (sepal['sepal length'] + sepal['sepal width'])/2

   sepal length  sepal width  mean
0           5.1          3.5  4.30
1           4.9          3.0  3.95
2           4.7          3.2  3.95
3           4.6          3.1  3.85
4           5.0          3.6  4.30

## Indexación en Pandas

Pandas cuenta con operadores de acceso propios: iloc y loc.

### Selección basada en índices
Es uno de los dos paradigmas para seleccionar datos. Se basa en el uso de índices: seleccionando datos basados en su posición numérica.

Es el paradigma que sigue iloc.

Lo podemos utilizar para seleccionar la primera fila del DataFrame:

In [25]:
sepal.iloc[0] # muestra los valores de la primera fila

sepal length    5.1
sepal width     3.5
mean            4.3
Name: 0, dtype: float64

Tanto en .loc y .iloc el primer valor corresponde a la fila y el siguiente a la columna. 

Para obtener una columna con .iloc tenemos que seleccionar todas las filas y la columna que deseamos. Por ejemplo, podemos seleccionar la última columna:

In [26]:
sepal.iloc[:,-1]

0      4.30
1      3.95
2      3.95
3      3.85
4      4.30
       ...
145    4.85
146    4.40
147    4.75
148    4.80
149    4.45
Name: mean, Length: 150, dtype: float64

Los dos puntos hacen referencia a todo (= todas las filas) y el valor de -1 al acceso a la última columna. El operador : también se puede utilizar para establecer rangos desde varios números (1:5), desde el inicio hasta un número (:5) o desde un número hasta el final (5:).

In [27]:
sepal.iloc[:3] # tres primeras filas

   sepal length  sepal width  mean
0           5.1          3.5  4.30
1           4.9          3.0  3.95
2           4.7          3.2  3.95

In [28]:
sepal.iloc[5:9] # de la quinta a la novena fila

   sepal length  sepal width  mean
5           5.4          3.9  4.65
6           4.6          3.4  4.00
7           5.0          3.4  4.20
8           4.4          2.9  3.65

In [29]:
sepal.iloc[140:] # de la fila 140 hasta la última

     sepal length  sepal width  mean
140           6.7          3.1  4.90
141           6.9          3.1  5.00
142           5.8          2.7  4.25
143           6.8          3.2  5.00
144           6.7          3.3  5.00
145           6.7          3.0  4.85
146           6.3          2.5  4.40
147           6.5          3.0  4.75
148           6.2          3.4  4.80
149           5.9          3.0  4.45

También se puede utilizar una lista para personalizar la selección:

In [30]:
mylist = [3, 6, 10, 13]
sepal.iloc[mylist]

    sepal length  sepal width  mean
3            4.6          3.1  3.85
6            4.6          3.4  4.00
10           5.4          3.7  4.55
13           4.3          3.0  3.65

### Selección basada en nombres

En el segundo paradigma, se utiliza el valor del nombre de la columna o del índice para hacer la selección.

De manera que podríamos obtener los valores de entrada de la manera siguiente:

In [31]:
iris.loc[:, 'class']

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: class, Length: 150, dtype: object

In [32]:
iris.loc[5:12, ['class', 'sepal length']]

          class  sepal length
5   Iris-setosa           5.4
6   Iris-setosa           4.6
7   Iris-setosa           5.0
8   Iris-setosa           4.4
9   Iris-setosa           4.9
10  Iris-setosa           5.4
11  Iris-setosa           4.8
12  Iris-setosa           4.8

## Selección basada en condiciones

A veces, vamos a estar interesados en una única condicion o en varias de ellas.

Por ejemplo, podríamos estar interesados en una única clase de planta y querríamos seleccionar solo esa.

In [33]:
iris['class'] == 'Iris-setosa' # bool function devuelve cuando la condición es cierta

0       True
1       True
2       True
3       True
4       True
       ...
145    False
146    False
147    False
148    False
149    False
Name: class, Length: 150, dtype: bool

Utilizando .loc podemos introducir este resultado para filtrar las plantas de la clase setosa.

De manera que los resultados que sean verdaderos serán devueltos por .loc.

In [34]:
iris.loc[iris['class'] == 'Iris-setosa'].head()

   sepal length  sepal width  petal length  petal width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

Podemos seleccionar en base a que se den dos condiciones:

In [35]:
iris.loc[(iris['class'] == 'Iris-setosa') & (iris['sepal length'] > 5.4)]

    sepal length  sepal width  petal length  petal width        class
14           5.8          4.0           1.2          0.2  Iris-setosa
15           5.7          4.4           1.5          0.4  Iris-setosa
18           5.7          3.8           1.7          0.3  Iris-setosa
33           5.5          4.2           1.4          0.2  Iris-setosa
36           5.5          3.5           1.3          0.2  Iris-setosa

Podemos seleccionar si se da una u otra condición:

In [36]:
iris.loc[(iris['sepal width'] < 2.5) | (iris['sepal length'] > 7.5)]

     sepal length  sepal width  petal length  petal width            class
41            4.5          2.3           1.3          0.3      Iris-setosa
53            5.5          2.3           4.0          1.3  Iris-versicolor
57            4.9          2.4           3.3          1.0  Iris-versicolor
60            5.0          2.0           3.5          1.0  Iris-versicolor
62            6.0          2.2           4.0          1.0  Iris-versicolor
68            6.2          2.2           4.5          1.5  Iris-versicolor
80            5.5          2.4           3.8          1.1  Iris-versicolor
81            5.5          2.4           3.7          1.0  Iris-versicolor
87            6.3          2.3           4.4          1.3  Iris-versicolor
93            5.0          2.3           3.3          1.0  Iris-versicolor
105           7.6          3.0           6.6          2.1   Iris-virginica
117           7.7          3.8           6.7          2.2   Iris-virginica
118           7.7          2.6           6.9          2.3   Iris-virginica
119           6.0          2.2           5.0          1.5   Iris-virginica
122           7.7          2.8           6.7          2.0   Iris-virginica
131           7.9          3.8           6.4          2.0   Iris-virginica
135           7.7          3.0           6.1          2.3   Iris-virginica

## Asignar nuevos valores

Para crear nuevas columnas, panddas cuenta con algunas funciones adicionales. DataFame.insert() nos va a permitir crear una variable, pero además nos va a permitir poner la columna en el lugar que queramos del DataFrame.

In [37]:
iris['Statistician'] = 'Ronald Fisher'
iris.head()

,sepal length,sepal width,petal length,petal width,class,Statistician
0,5.1,3.5,1.4,0.2,Iris-setosa,Ronald Fisher
1,4.9,3.0,1.4,0.2,Iris-setosa,Ronald Fisher
2,4.7,3.2,1.3,0.2,Iris-setosa,Ronald Fisher
3,4.6,3.1,1.5,0.2,Iris-setosa,Ronald Fisher
4,5.0,3.6,1.4,0.2,Iris-setosa,Ronald Fisher

In [38]:
iris['sepal length'].max()

7.9

Además, hay maneras más sofisticadas de crear variables. Por ejemplo usando list comprehensions:

In [39]:
iris.insert(1, 'sepal length scaled', 
            [round(i/iris['sepal length'].max(), 3) 
                for i in iris['sepal length']])

Si tenéis interés en saber más sobre list comprehensions os recomiendo este enlace:

https://www.w3schools.com/python/python_lists_comprehension.asp

In [40]:
iris.head()

,sepal length,sepal length scaled,sepal width,petal length,petal width,class,Statistician
0,5.1,0.646,3.5,1.4,0.2,Iris-setosa,Ronald Fisher
1,4.9,0.620,3.0,1.4,0.2,Iris-setosa,Ronald Fisher
2,4.7,0.595,3.2,1.3,0.2,Iris-setosa,Ronald Fisher
3,4.6,0.582,3.1,1.5,0.2,Iris-setosa,Ronald Fisher
4,5.0,0.633,3.6,1.4,0.2,Iris-setosa,Ronald Fisher

## Maps

Maps toma un conjunto de valores y los "mapea" a otro conjunto de valores. En Data Science, a menudo necesitamos crear nuevas representaciones a partir de los datos existentes, o transformar los datos del formato actual al formato que queremos que tengan más adelante. Los mapas son los que se encargan de este trabajo, por lo que son extremadamente importantes para realizar el trabajo.

Hay dos métodos importantes:

map() es el primero y aplica una función a todo un conjunto de datos.Por ejemplo, supongamos que queremos volver a calcular los valores escallados de sepal length.

In [41]:
iris['sepal length'].map(lambda i: i/iris['sepal length'].max())

0      0.645570
1      0.620253
2      0.594937
3      0.582278
4      0.632911
         ...
145    0.848101
146    0.797468
147    0.822785
148    0.784810
149    0.746835
Name: sepal length, Length: 150, dtype: float64

Lambda es una función anónima. Funciona igual que una función normal, pero se declara en una línea y no recibe ningún nombre.

map() devuelve una Serie nueva con todos los valores transformados por la función. Al final lo que estamos haciendo es mapear una función a todo un conjunto de datos. Es decir, utilizando map() aplicamos la función a cada elemento.

apply() aplica una función a todo un eje de un DataFrame. El eje puede ser el de las columnas o el de las filas.

La diferencia entre apply y map es que map actúa en una única Serie, mientras que apply actúa en todo el DataFrame.

In [42]:
sepal.head()

   sepal length  sepal width  mean
0           5.1          3.5  4.30
1           4.9          3.0  3.95
2           4.7          3.2  3.95
3           4.6          3.1  3.85
4           5.0          3.6  4.30

In [43]:
sepal.apply(lambda i: i/10).head()

   sepal length  sepal width   mean
0          0.51         0.35  0.430
1          0.49         0.30  0.395
2          0.47         0.32  0.395
3          0.46         0.31  0.385
4          0.50         0.36  0.430

## Agrupar y Ordenar Valores en un DataFrame

In [44]:
iris.head()

,sepal length,sepal length scaled,sepal width,petal length,petal width,class,Statistician
0,5.1,0.646,3.5,1.4,0.2,Iris-setosa,Ronald Fisher
1,4.9,0.620,3.0,1.4,0.2,Iris-setosa,Ronald Fisher
2,4.7,0.595,3.2,1.3,0.2,Iris-setosa,Ronald Fisher
3,4.6,0.582,3.1,1.5,0.2,Iris-setosa,Ronald Fisher
4,5.0,0.633,3.6,1.4,0.2,Iris-setosa,Ronald Fisher

### Groupby

Permite agrupar en base a una característica. Por ejemplo, en base a la clase. Este es un método útil si queremos contar el número de instancias de cada una de las clases o si queremos calcular las medias de distintos grupos.

Pongamos un ejemplos con los datos de Iris:

In [45]:
iris.groupby('class').mean()

,sepal length,sepal length scaled,sepal width,petal length,petal width
class,,,,,
Iris-setosa,5.006,0.63380,3.418,1.464,0.244
Iris-versicolor,5.936,0.75134,2.770,4.260,1.326
Iris-virginica,6.588,0.83384,2.974,5.552,2.026

Ahora podemos ver las medias para los diferentes atributos de las clases. Lo que nos puede ayudar en un proceso de análisis exploratorio.

Groupby() es un objeto especial en los que cada grupo contiene un trozo del dataframe con los valores que coinciden en la misma clase.

In [46]:
iris.groupby('class')

Otra función útil de groupby() es agg() que te permite correr múltiples funciones diferentes al mismo tiempo. Por ejemplo, podemos calcuar la media, la mediana, el valor máximo y mínimo de un atributo:

In [54]:
from statistics import median
from statistics import mean


iris[['class', 'petal length']].groupby('class').agg([mean, median, max, min])

                petal length
                        mean median  max  min
class
Iris-setosa            1.464   1.50  1.9  1.0
Iris-versicolor        4.260   4.35  5.1  3.0
Iris-virginica         5.552   5.55  6.9  4.5

## Multi - Indexing

In [62]:
df = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/flightdata.csv', index_col=0, nrows=50)

In [64]:
df.shape

(50, 30)

In [65]:
df.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,...,totflight,avgdelay,airline,airport,lat,lon,alt,tz,dst,tzone
1,2013,1,1,542,540,2,923,850,33,AA,...,91,2.101124,American Airlines Inc.,Miami Intl,25.793250,-80.290556,8,-5,A,America/New_York
2,2013,1,1,554,600,-6,812,837,-25,DL,...,268,-0.708812,Delta Air Lines Inc.,Hartsfield Jackson Atlanta Intl,33.636719,-84.428067,1026,-5,A,America/New_York
3,2013,1,1,554,558,-4,740,728,12,UA,...,1,-4.000000,United Air Lines Inc.,Chicago Ohare Intl,41.978603,-87.904842,668,-6,A,America/Chicago
4,2013,1,1,555,600,-5,913,854,19,B6,...,168,0.789157,JetBlue Airways,Fort Lauderdale Hollywood Intl,26.072583,-80.152750,9,-5,A,America/New_York
5,2013,1,1,557,600,-3,838,846,-8,B6,...,162,-0.440994,JetBlue Airways,Orlando Intl,28.429394,-81.308994,96,-5,A,America/New_York

In [66]:
df.columns

Index(['year', 'month', 'day', 'dep_time', 'sched_dep_time', 'dep_delay',
       'arr_time', 'sched_arr_time', 'arr_delay', 'carrier', 'flight',
       'tailnum', 'origin', 'dest', 'air_time', 'distance', 'hour', 'minute',
       'time_hour', 'flightb', 'totflight', 'avgdelay', 'airline', 'airport',
       'lat', 'lon', 'alt', 'tz', 'dst', 'tzone'],
      dtype='object')

In [68]:
df[['flight','tailnum', 'origin', 'dest', 'air_time', 'distance',
'hour', 'minute', 'time_hour', 'flightb']]

,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour,flightb
1,1141,N619AA,JFK,MIA,160,1089,5,40,2013-01-01 05:00:00,AA 1141 (to MIA)
2,461,N668DN,LGA,ATL,116,762,6,0,2013-01-01 06:00:00,DL 461 (to ATL)
3,1696,N39463,EWR,ORD,150,719,5,58,2013-01-01 05:00:00,UA 1696 (to ORD)
4,507,N516JB,EWR,FLL,158,1065,6,0,2013-01-01 06:00:00,B6 507 (to FLL)
5,79,N593JB,JFK,MCO,140,944,6,0,2013-01-01 06:00:00,B6 79 (to MCO)
6,301,N3ALAA,LGA,ORD,138,733,6,0,2013-01-01 06:00:00,AA 301 (to ORD)
7,194,N29129,JFK,LAX,345,2475,6,0,2013-01-01 06:00:00,UA 194 (to LAX)
8,1124,N53441,EWR,SFO,361,2565,6,0,2013-01-01 06:00:00,UA 1124 (to SFO)
9,1806,N708JB,JFK,BOS,44,187,5,59,2013-01-01 05:00:00,B6 1806 (to BOS)
10,371,N595JB,LGA,FLL,152,1076,6,0,2013-01-01 06:00:00,B6 371 (to FLL)
11,4650,N542MQ,LGA,ATL,134,762,6,0,2013-01-01 06:00:00,MQ 4650 (to ATL)
12,1895,N633AA,EWR,MIA,152,1085,6,10,2013-01-01 06:00:00,AA 1895 (to MIA)
13,1743,N3739P,JFK,ATL,128,760,6,10,2013-01-01 06:00:00,DL 1743 (to ATL)
14,1077,N53442,EWR,MIA,157,1085,6,7,2013-01-01 06:00:00,UA 1077 (to MIA)
15,3768,N9EAMQ,EWR,ORD,139,719,6,0,2013-01-01 06:00:00,MQ 3768 (to ORD)
16,303,N532UA,JFK,SFO,366,2586,6,0,2013-01-01 06:00:00,UA 303 (to SFO)
17,575,N326NB,EWR,ATL,120,746,6,15,2013-01-01 06:00:00,DL 575 (to ATL)
18,1837,N3EMAA,LGA,MIA,153,1096,6,10,2013-01-01 06:00:00,AA 1837 (to MIA)
19,1665,N33289,EWR,LAX,366,2454,6,30,2013-01-01 06:00:00,UA 1665 (to LAX)
20,303,N3CYAA,LGA,ORD,140,733,6,30,2013-01-01 06:00:00,AA 303 (to ORD)
21,1019,N426US,EWR,CLT,91,529,6,30,2013-01-01 06:00:00,US 1019 (to CLT)
22,389,N709JB,LGA,MCO,144,950,6,45,2013-01-01 06:00:00,B6 389 (to MCO)
23,1002,N805JB,JFK,BOS,41,187,6,40,2013-01-01 06:00:00,B6 1002 (to BOS)
24,926,N178US,EWR,CLT,91,529,6,45,2013-01-01 06:00:00,US 926 (to CLT)
25,1701,N75435,EWR,FLL,151,1065,6,36,2013-01-01 06:00:00,UA 1701 (to FLL)
26,1865,N705TW,JFK,SFO,362,2586,7,0,2013-01-01 07:00:00,DL 1865 (to SFO)
27,2003,N997DL,LGA,MIA,161,1096,7,0,2013-01-01 07:00:00,DL 2003 (to MIA)
28,305,N4WNAA,LGA,ORD,143,733,7,0,2013-01-01 07:00:00,AA 305 (to ORD)
29,1815,N5FMAA,JFK,MCO,142,944,6,59,2013-01-01 06:00:00,AA 1815 (to MCO)
30,1879,N318NB,LGA,FLL,164,1076,7,0,2013-01-01 07:00:00,DL 1879 (to FLL)
31,1547,N6703D,LGA,ATL,126,762,7,0,2013-01-01 07:00:00,DL 1547 (to ATL)
32,2279,N3EKAA,LGA,MIA,159,1096,7,0,2013-01-01 07:00:00,AA 2279 (to MIA)
33,981,N646JB,JFK,FLL,156,1069,7,0,2013-01-01 07:00:00,B6 981 (to FLL)
34,671,N779JB,JFK,LAX,381,2475,7,0,2013-01-01 07:00:00,B6 671 (to LAX)
35,1092,N26226,LGA,ORD,135,733,7,0,2013-01-01 07:00:00,UA 1092 (to ORD)
36,825,N3ETAA,JFK,FLL,159,1069,7,15,2013-01-01 07:00:00,AA 825 (to FLL)
37,544,N841UA,EWR,ORD,156,719,7,13,2013-01-01 07:00:00,UA 544 (to ORD)
38,987,N562JB,JFK,MCO,147,944,7,21,2013-01-01 07:00:00,B6 987 (to MCO)
39,1111,N37456,EWR,MCO,145,937,6,45,2013-01-01 06:00:00,UA 1111 (to MCO)
40,643,N625JB,JFK,SFO,350,2586,7,37,2013-01-01 07:00:00,B6 643 (to SFO)
41,309,N4WPAA,LGA,ORD,137,733,7,45,2013-01-01 07:00:00,AA 309 (to ORD)
42,33,N338AA,JFK,LAX,358,2475,7,30,2013-01-01 07:00:00,AA 33 (to LAX)
43,59,N336AA,JFK,SFO,378,2586,7,45,2013-01-01 07:00:00,AA 59 (to SFO)
44,1668,N24224,EWR,SFO,373,2565,7,46,2013-01-01 07:00:00,UA 1668 (to SFO)
45,3737,N508MQ,EWR,ORD,148,719,7,10,2013-01-01 07:00:00,MQ 3737 (to ORD)
46,2263,N325US,LGA,MCO,140,950,7,55,2013-01-01 07:00:00,DL 2263 (to MCO)
47,1733,N543UW,LGA,CLT,96,544,7,59,2013-01-01 07:00:00,US 1733 (to CLT)
48,2267,N3HMAA,LGA,MIA,157,1096,7,55,2013-01-01 07:00:00,AA 2267 (to MIA)
49,2047,N935DL,LGA,ATL,126,762,7,59,2013-01-01 07:00:00,DL 2047 (to ATL)
50,517,N645JB,EWR,MCO,142,937,8,0,2013-01-01 08:00:00,B6 517 (to MCO)

In [ ]:
df.groupby(['airline', ''])